## Terraform [0.1251210876.1-pr](https://dev.azure.com/mloskot/terraform-github-pr-commenter/_build/results?buildId=360) - `DEV` - `docker-step-4-change` - `plan`

Plan will apply 0 changes (based on JSON output)

Plan: 1 to add, 0 to change, 1 to destroy.

<details><summary><strong>Details</strong></summary>

```diff
docker_image.nginx: Refreshing state... [id=sha256:3f8a00f137a0d2c8a2163a09901e28e2471999fde4efc2f9570b91f1c30acf94nginx:latest]
docker_container.nginx: Refreshing state... [id=788ffbf38f5dc2f56511bb1c258def8d0212d79adc7cbee26205792f65d23342]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # docker_container.nginx must be replaced
-/+ resource "docker_container" "nginx" {
+       bridge                                      = (known after apply)
~       command                                     = [
-           "nginx",
-           "-g",
-           "daemon off;",
        ] -> (known after apply)
+       container_logs                              = (known after apply)
-       cpu_shares                                  = 0 -> null
-       dns                                         = [] -> null
-       dns_opts                                    = [] -> null
-       dns_search                                  = [] -> null
~       entrypoint                                  = [
-           "/docker-entrypoint.sh",
        ] -> (known after apply)
~       env                                         = [] -> (known after apply)
+       exit_code                                   = (known after apply)
-       group_add                                   = [] -> null
~       hostname                                    = "788ffbf38f5d" -> (known after apply)
~       id                                          = "788ffbf38f5dc2f56511bb1c258def8d0212d79adc7cbee26205792f65d23342" -> (known after apply)
~       init                                        = false -> (known after apply)
~       ipc_mode                                    = "private" -> (known after apply)
~       log_driver                                  = "json-file" -> (known after apply)
-       log_opts                                    = {} -> null
-       max_retry_count                             = 0 -> null
-       memory                                      = 0 -> null
-       memory_swap                                 = 0 -> null
        name                                        = "tutorial"
~       network_data                                = [
-           {
-               gateway                   = "172.17.0.1"
-               global_ipv6_address       = ""
-               global_ipv6_prefix_length = 0
-               ip_address                = "172.17.0.2"
-               ip_prefix_length          = 16
-               ipv6_gateway              = ""
-               network_name              = "bridge"
            },
        ] -> (known after apply)
-       network_mode                                = "default" -> null
-       privileged                                  = false -> null
-       publish_all_ports                           = false -> null
~       runtime                                     = "runc" -> (known after apply)
~       security_opts                               = [] -> (known after apply)
~       shm_size                                    = 64 -> (known after apply)
~       stop_signal                                 = "SIGQUIT" -> (known after apply)
~       stop_timeout                                = 0 -> (known after apply)
-       storage_opts                                = {} -> null
-       sysctls                                     = {} -> null
-       tmpfs                                       = {} -> null
        # (14 unchanged attributes hidden)

+       healthcheck {
+           interval     = (known after apply)
+           retries      = (known after apply)
+           start_period = (known after apply)
+           test         = (known after apply)
+           timeout      = (known after apply)
        }

+       labels {
+           label = (known after apply)
+           value = (known after apply)
        }

~       ports {
~           external = 8000 -> 8080 # forces replacement
            # (3 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

